DavidAnson.vscode-markdownlint
eamodio.gitlens
esbenp.prettier-vscode
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
nomi9995.intellij-merge-tool
rvest.vs-code-prettier-eslint
shd101wyy.markdown-preview-enhanced
tamasfe.even-better-toml
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
VisualStudioExptTeam.vscodeintellicode-completions
VisualStudioExptTeam.vscodeintellicode-insiders
