# visual/dev improvements
aaron-bond.better-comments
eamodio.gitlens
equinusocio.vsc-material-theme-icons
johnpapa.vscode-peacock
oderwat.indent-rainbow
streetsidesoftware.code-spell-checker
usernamehw.errorlens

# command-palette tools
alefragnani.bookmarks
donjayamanne.githistory

# python
charliermarsh.ruff
mgesbert.indent-nested-dictionary
ms-python.python

# bash
timonwong.shellcheck

# js/ts
dbaeumer.vscode-eslint
esbenp.prettier-vscode
orta.vscode-jest

# markdown and protocols
DavidAnson.vscode-markdownlint
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
tamasfe.even-better-toml
zainchen.json

# autocompletion, llms, etc.
christian-kohler.path-intellisense
VisualStudioExptTeam.vscodeintellicode
VisualStudioExptTeam.vscodeintellicode-completions
codeium.codeium
